//1： c语言允许直接访问内存地址，能进行位操作（bit） 。


//2： 数据类型
//        1：基本数据类型
//        2：构造数据类型  ： 数组类型、结构体类型、共用体类型
//        3：指针类型      用来表示某个变量在内存储器中的地址。
//        4：空类型


//3： 符号常量 ： 在使用之前必须先定义，其一般形式为
//                #define 标识符 常量


//4: 一个字节BYTE  = 8 位bit
//     数值在计算机中是以补码的形式存在的：
//        正数的补码与源码相同。
//        负数的补码：将该数的绝对值的二进制形式按位取反再加1
//          八个bit 第一位是符号位


//5： 字符串默认有\0结尾


//6： 变量转换规则：
//        1：转换按数据长度增加的方向，以保障精度不降低
//        2：flaot 转换为 double
//        3：char 和 short 必须先转换成int型


//7：
